app/controllers/reviews_controller.rb

SELECT  "wines".* FROM "wines" WHERE "wines"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "reviews".* FROM "reviews"
---
  def index
    #@reviews = Review.all
    #1st I am retrieving the wine thanks to params[wine_id]
    wine = Wine.find(params[:wine_id])
    #2nd I get all the reviews of this wine
  #@reviews = wine.reviews
    @reviews = Review.all

SELECT  "wines".* FROM "wines" WHERE "wines"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    #1st I am retrieving the wine thanks to params[wine_id]
    wine = Wine.find(params[:wine_id])

SELECT  "wines".* FROM "wines" WHERE "wines"."id" = $1 LIMIT 1  [["id", 1]]
---
  def new
    @review = Review.new
    #1st I am retrieving the wine thanks to params[wine_id]
    wine = Wine.find(params[:wine_id])

SELECT  "wines".* FROM "wines" WHERE "wines"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
    #1st I am retrieving the wine thanks to params[wine_id]
    wine = Wine.find(params[:wine_id])

SELECT  "wines".* FROM "wines" WHERE "wines"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "reviews" ("expert_name", "review", "rating", "wine_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
  #@review = Review.new(review_params)

    #1st I am retrieving the wine thanks to params[wine_id]
  @wine = Wine.find(params[:wine_id])
    #2nd I create the review with the arguments in params[:review]
    @review = @wine.reviews.create!(params.require(:review).permit!)