app/controllers/wines_controller.rb

SELECT COUNT(*) FROM "wines"
---
  def index
    wines = Wine.order(id: :asc)
    render json: {
      meta: {
        count: Wine.count,
        page: 0